Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           (None, 480, 640, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 480, 640, 32)      896       
_________________________________________________________________
bn_1 (BatchNormalization)    (None, 480, 640, 32)      128       
_________________________________________________________________
leaky_relu_1 (LeakyReLU)     (None, 480, 640, 32)      0         
_________________________________________________________________
max_pooling_1 (MaxPooling2D) (None, 240, 320, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 240, 320, 64)      18496     
_________________________________________________________________
bn_2 (BatchNormalization)    (None, 240, 320, 64)      256       
_________________________________________________________________
leaky_relu_2 (LeakyReLU)     (None, 240, 320, 64)      0         
_________________________________________________________________
max_pooling_2 (MaxPooling2D) (None, 120, 160, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 120, 160, 128)     73856     
_________________________________________________________________
bn_3 (BatchNormalization)    (None, 120, 160, 128)     512       
_________________________________________________________________
leaky_relu_3 (LeakyReLU)     (None, 120, 160, 128)     0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 120, 160, 64)      8256      
_________________________________________________________________
bn_4 (BatchNormalization)    (None, 120, 160, 64)      256       
_________________________________________________________________
leaky_relu_4 (LeakyReLU)     (None, 120, 160, 64)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 120, 160, 128)     73856     
_________________________________________________________________
bn_5 (BatchNormalization)    (None, 120, 160, 128)     512       
_________________________________________________________________
leaky_relu_5 (LeakyReLU)     (None, 120, 160, 128)     0         
_________________________________________________________________
max_pooling_3 (MaxPooling2D) (None, 60, 80, 128)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 60, 80, 256)       295168    
_________________________________________________________________
bn_6 (BatchNormalization)    (None, 60, 80, 256)       1024      
_________________________________________________________________
leaky_relu_6 (LeakyReLU)     (None, 60, 80, 256)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 60, 80, 128)       32896     
_________________________________________________________________
bn_7 (BatchNormalization)    (None, 60, 80, 128)       512       
_________________________________________________________________
leaky_relu_7 (LeakyReLU)     (None, 60, 80, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 60, 80, 256)       295168    
_________________________________________________________________
bn_8 (BatchNormalization)    (None, 60, 80, 256)       1024      
_________________________________________________________________
leaky_relu_8 (LeakyReLU)     (None, 60, 80, 256)       0         
_________________________________________________________________
max_pooling_4 (MaxPooling2D) (None, 30, 40, 256)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 30, 40, 512)       1180160   
_________________________________________________________________
bn_9 (BatchNormalization)    (None, 30, 40, 512)       2048      
_________________________________________________________________
leaky_relu_9 (LeakyReLU)     (None, 30, 40, 512)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 30, 40, 256)       131328    
_________________________________________________________________
bn_10 (BatchNormalization)   (None, 30, 40, 256)       1024      
_________________________________________________________________
leaky_relu_10 (LeakyReLU)    (None, 30, 40, 256)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 30, 40, 512)       1180160   
_________________________________________________________________
bn_11 (BatchNormalization)   (None, 30, 40, 512)       2048      
_________________________________________________________________
leaky_relu_11 (LeakyReLU)    (None, 30, 40, 512)       0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 30, 40, 256)       131328    
_________________________________________________________________
bn_12 (BatchNormalization)   (None, 30, 40, 256)       1024      
_________________________________________________________________
leaky_relu_12 (LeakyReLU)    (None, 30, 40, 256)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 30, 40, 512)       1180160   
_________________________________________________________________
bn_13 (BatchNormalization)   (None, 30, 40, 512)       2048      
_________________________________________________________________
leaky_relu_13 (LeakyReLU)    (None, 30, 40, 512)       0         
_________________________________________________________________
max_pooling_5 (MaxPooling2D) (None, 15, 20, 512)       0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 15, 20, 1024)      4719616   
_________________________________________________________________
bn_14 (BatchNormalization)   (None, 15, 20, 1024)      4096      
_________________________________________________________________
leaky_relu_14 (LeakyReLU)    (None, 15, 20, 1024)      0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 15, 20, 512)       524800    
_________________________________________________________________
bn_15 (BatchNormalization)   (None, 15, 20, 512)       2048      
_________________________________________________________________
leaky_relu_15 (LeakyReLU)    (None, 15, 20, 512)       0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 15, 20, 1024)      4719616   
_________________________________________________________________
bn_16 (BatchNormalization)   (None, 15, 20, 1024)      4096      
_________________________________________________________________
leaky_relu_16 (LeakyReLU)    (None, 15, 20, 1024)      0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 15, 20, 512)       524800    
_________________________________________________________________
bn_17 (BatchNormalization)   (None, 15, 20, 512)       2048      
_________________________________________________________________
leaky_relu_17 (LeakyReLU)    (None, 15, 20, 512)       0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 15, 20, 1024)      4719616   
_________________________________________________________________
bn_18 (BatchNormalization)   (None, 15, 20, 1024)      4096      
_________________________________________________________________
leaky_relu_18 (LeakyReLU)    (None, 15, 20, 1024)      0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 15, 20, 1024)      9438208   
_________________________________________________________________
bn_19 (BatchNormalization)   (None, 15, 20, 1024)      4096      
_________________________________________________________________
leaky_relu_19 (LeakyReLU)    (None, 15, 20, 1024)      0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 15, 20, 1024)      9438208   
_________________________________________________________________
bn_20 (BatchNormalization)   (None, 15, 20, 1024)      4096      
_________________________________________________________________
leaky_relu_20 (LeakyReLU)    (None, 15, 20, 1024)      0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 15, 20, 1024)      9438208   
_________________________________________________________________
bn_21 (BatchNormalization)   (None, 15, 20, 1024)      4096      
_________________________________________________________________
leaky_relu_21 (LeakyReLU)    (None, 15, 20, 1024)      0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 15, 20, 425)       435625    
_________________________________________________________________
flatten_1 (Flatten)          (None, 127500)            0         
_________________________________________________________________
fc_1 (Dense)                 (None, 64)                8160064   
_________________________________________________________________
fc_2 (Dense)                 (None, 64)                4160      
_________________________________________________________________
fc_3 (Dense)                 (None, 4)                 260       
=================================================================
Total params: 56,765,997
Trainable params: 56,745,453
Non-trainable params: 20,544
